zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pwr.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_pwr.c
  * @author  MCD Application Team
  * @brief   PWR HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Power Controller (PWR) peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Control functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal.h"

/** @addtogroup STM32MP2xx_HAL_Driver

  * @{
  */

/** @defgroup PWR PWR
  * @brief PWR HAL module driver
  * @{
  */

#ifdef HAL_PWR_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @addtogroup PWR_Private_Constants PWR Private Constants
  * @{
  */

/** @defgroup PWR_PVD_Mode_Mask PWR PVD Mode Mask
  * @{
  */


#define PWR_FLAG_SETTING_DELAY_US  1000U
/**
  * @}
  */

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/** @defgroup PWR_Private_Macros PWR Private Macros
  * @brief    PWR Private Macros
  * @{
  */

#define WIO_CID_CFG_ADD_OFFSET 0x02u
#define R_CID_CFG_ADD_OFFSET   0x01u
#define WKUPCR_ADD_OFFSET      0x01u

/**
  * @}
  */

/* Private variable -------------------------------------------------------------*/
/** @addtogroup PWR_Private_Variables PWR Private Variables
  * @{
  */
#if !defined(CORE_CM0PLUS)
static uint32_t extiImr2WakeUp[] =
{
  __HAL_WKUP_LINE0_EXTI_MSK,
  __HAL_WKUP_LINE1_EXTI_MSK,
  __HAL_WKUP_LINE2_EXTI_MSK,
  __HAL_WKUP_LINE3_EXTI_MSK,
  __HAL_WKUP_LINE4_EXTI_MSK,
  __HAL_WKUP_LINE5_EXTI_MSK
};
#endif /* CORE_CM0PLUS */
/**
  * @}
  */
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup PWR_Private_Functions PWR Private Functions
  * @{
  */
static void GateCortexSubsystemClockOnSleepEntry(void);
static void KeepCortexSubsystemClockOnSleepEntry(void);
static void ClearStandbyRequest();
#if !defined(CORE_CM0PLUS)
static void SetStandbyRequest(uint8_t STANDBYType);
#endif /* CORE_CM0PLUS */
static void SetRegulatorStopModeIndicator(uint32_t Regulator);
static void ClearRegulatorStopModeIndicator(void);
HAL_StatusTypeDef HAL_PWR_ConfigWioResourceAttributes(uint16_t Resource, uint32_t ResourceAttributes);
HAL_StatusTypeDef HAL_PWR_GetConfigWioResourceAttributes(uint16_t Resource, uint32_t *pResourceAttributes);
HAL_StatusTypeDef HAL_PWR_ConfigNonShareableResourceAttributes(uint16_t Resource, uint32_t ResourceAttributes);
HAL_StatusTypeDef HAL_PWR_GetConfigNonShareableResourceAttributes(uint16_t Resource, uint32_t *pResourceAttributes);

/** @defgroup PWR_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and de-initialization functions
  *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]
      After reset, the backup domain (RTC registers, RTC backup data
      registers and backup SRAM) is protected against possible unwanted
      write accesses.
      To enable access to the RTC Domain and RTC registers, proceed as follows:
        (+) Enable access to RTC domain using the HAL_PWR_EnableBkUpD3Access() function.

@endverbatim
  * @{
  */

#if !defined(CORE_CM0PLUS)
#if defined(PWR_BDCR1_DBD3P)
/**
  * @brief  Enables WRITE access to the backup and D3 domain
  *         In reset state, the RCC_BDCR, PWR_CR2, RTC, and backup registers are
  *         protected against parasitic write access. DBP bit must be set to enable
  *         write access to these.
  *         access write : Secure privilege needed + CID filtering
  * @retval None
  */
void HAL_PWR_EnableBkUpD3Access(void)
{
  SET_BIT(PWR->BDCR1, PWR_BDCR1_DBD3P);
}

/**
  * @brief  Disables WRITE access to the backup and D3 domain
  *         backup data registers and backup SRAM) and D3 domain .
  * @retval None
  */
void HAL_PWR_DisableBkUpD3Access(void)
{
  CLEAR_BIT(PWR->BDCR1, PWR_BDCR1_DBD3P);
}

#endif /* defined(PWR_BDCR1_DBD3P) */

#if defined(PWR_BDCR_DBP)
/**
  * @brief  Enables WRITE access to the backup domain
  *         access write : Secure privilege needed + CID filtering
  * @retval None
  */
void HAL_PWR_EnableBkUpAccess(void)
{
  SET_BIT(PWR->BDCR, PWR_BDCR_DBP);
}
/**
  * @brief  Disables WRITE access to the backup domain
  *         access write : Secure privilege needed + CID filtering
  * @retval None
  */
void HAL_PWR_DisableBkUpAccess(void)
{
  CLEAR_BIT(PWR->BDCR, PWR_BDCR_DBP);
}
#endif /* defined(PWR_BDCR_DBP) */
#else
/**
  * @brief  Enables WRITE access to the backup domain
  *         Even if  D3 domain and backup domain are often open together (see HAL_PWR_EnableBkUpD3Access)
  *         In some very few cases, D3 can be on but backup off
  *         write access only by M0+
  * @retval None
  */
void HAL_PWR_EnableBkUpAccess(void)
{
  SET_BIT(PWR->BDCR2, PWR_BDCR2_DBP);
}
/**
  * @brief  Disables WRITE access to the backup domain
  *         Write access only by M0+
  * @retval None
  */
void HAL_PWR_DisableBkUpAccess(void)
{
  CLEAR_BIT(PWR->BDCR2, PWR_BDCR2_DBP);
}

#endif /*!defined(CORE_CM0PLUS)*/
/**
  * @}
  */

/** @defgroup PWR_Group2 Peripheral Control functions
  *  @brief Low Power modes configuration functions
  *
@verbatim

 ===============================================================================
                 ##### Peripheral Control functions #####
 ===============================================================================

    *** PVD configuration ***
    =========================
    [..]
      (+) The PVD is used to monitor the VDD power supply by comparing it to a
          threshold selected by the PVD Level (PLS[2:0] bits in the PWR_CR).
      (+) A PVDO flag is available to indicate if VDD/VDDA is higher or lower
          than the PVD threshold. This event is internally connected to the EXTI
          line16 and can generate an interrupt if enabled. This is done through
          __HAL_PVD_EXTI_ENABLE_IT() macro.
      (+) The PVD is stopped in Standby mode.

