zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pwr.c
    *** WakeUp pin configuration ***
    ================================
    [..]
      (+) WakeUp pin is used to wake up the system from Standby mode. This pin is
          forced in input pull-down configuration and is active on rising edges.
      (+) There is only one WakeUp pin: WakeUp Pin 1 on PA.00.

    *** Low Power modes configuration ***
    =====================================
    [..]
      The devices feature 3 low-power modes:
      (+) Sleep mode: Cortex core stopped, peripherals kept running.
      (+) Stop mode: all clocks are stopped, regulator running, regulator
          in low power mode
      (+) Standby mode:  all regulators are switched off.

   *** Sleep mode ***
   ==================
    [..]
      (+) Entry:
        The Sleep mode is entered by using the HAL_PWR_EnterSLEEPMode()


      -@@- The Regulator parameter is not used for the STM32MP1/STM32MP2 family
              and is kept as parameter just to maintain compatibility with the
              lower power families (STM32L).
              (on MPx families regulator param are output only on CSTOP not on CSLEEP)
      (+) Exit:
        Any peripheral interrupt acknowledged by the nested vectored interrupt
              controller (NVIC) can wake up the device from Sleep mode.

   *** Stop mode ***
   =================
    [..]
      In Stop mode, all clocks sharing same power domain than CPU are stopped, the PLL, the HSI,
      and the HSE RC oscillators are disabled. Internal SRAM and register contents
      are preserved.
      The voltage regulator can be configured either in normal or low-power mode.


      (+) Entry:
         The Stop mode is entered using the HAL_PWR_EnterSTOPMode()

      (+) Exit:
        Any EXTI Line (Internal or External) configured in Interrupt/Event mode.

   *** Standby mode ***
   ====================
    [..]
    (+)
      The Standby mode allows to achieve the lowest power consumption.

      The voltage regulator is OFF.

      (++) Entry:
        (+++) The Standby mode is entered using the HAL_PWR_EnterSTANDBYMode() function.
      (++) Exit:
        (+++) WKUP pin rising edge, RTC alarm (Alarm A and Alarm B), RTC wakeup,
             tamper event, time-stamp event, external reset in NRST pin, IWDG reset.

   *** Auto-wakeup (AWU) from low-power mode ***
   =============================================
    [..]

     (+) The MCU can be woken up from low-power mode by an RTC Alarm event, an RTC
      Wakeup event, a tamper event or a time-stamp event, without depending on
      an external interrupt (Auto-wakeup mode).

      (+) RTC auto-wakeup (AWU) from the Stop and Standby modes

        (++) To wake up from the Stop mode with an RTC alarm event, it is necessary to
              configure the RTC to generate the RTC alarm using the HAL_RTC_SetAlarm_IT() function.

        (++) To wake up from the Stop mode with an RTC Tamper or time stamp event, it
             is necessary to configure the RTC to detect the tamper or time stamp event using the
                HAL_RTCEx_SetTimeStamp_IT() or HAL_RTCEx_SetTamper_IT() functions.

        (++) To wake up from the Stop mode with an RTC WakeUp event, it is necessary to
              configure the RTC to generate the RTC WakeUp event using the HAL_RTCEx_SetWakeUpTimer_IT() function.

@endverbatim
  * @{
  */

#if defined(CORE_CM33)||defined(CORE_CA35)
/**
  * @brief  Configures EXTI for  Power Voltage Detector(PVD).
  * @param  sConfigPVD: pointer to an PWR_PVDTypeDef structure that contains the configuration
  *         information for the PVD.
  * @note   Refer to the electrical characteristics of your device datasheet for
  *         more details about the voltage threshold corresponding to each
  *         detection level.
  * @retval None
  */
void HAL_PWR_ConfigPVD(const PWR_PVDTypeDef *sConfigPVD)
{
  /* Check the parameters */
  assert_param(IS_PWR_PVD_MODE(sConfigPVD->Mode));

  /* Clear any previous config. Keep it clear if no IT mode is selected */
  __HAL_PWR_PVD_EXTI_DISABLE_IT();
  __HAL_PWR_PVD_EXTI_DISABLE_RISING_FALLING_EDGE();

  /* Configure interrupt mode */
  if (IS_AN_INTERRUPT_PWR_PVD_MODE(sConfigPVD->Mode))
  {
    __HAL_PWR_PVD_EXTI_ENABLE_IT();
  }

  /* Configure the edge */
  if ((sConfigPVD->Mode) == PWR_PVD_MODE_IT_RISING)
  {
    __HAL_PWR_PVD_EXTI_ENABLE_RISING_EDGE();
  }

  if ((sConfigPVD->Mode) == PWR_PVD_MODE_IT_FALLING)
  {
    __HAL_PWR_PVD_EXTI_ENABLE_FALLING_EDGE();
  }

  if ((sConfigPVD->Mode) == PWR_PVD_MODE_IT_RISING_FALLING)
  {
    __HAL_PWR_PVD_EXTI_ENABLE_RISING_FALLING_EDGE();
  }
}

/**
  * @brief Enables the Power Voltage Detector(PVD).
  * @retval None
  */
void HAL_PWR_EnablePVD(void)
{
  /* Enable the power voltage detector */
  SET_BIT(PWR->CR3, PWR_CR3_PVDEN);
}

/**
  * @brief Disables the Power Voltage Detector(PVD).
  * @retval None
  */
void HAL_PWR_DisablePVD(void)
{
  /* Disable the power voltage detector */
  CLEAR_BIT(PWR->CR3, PWR_CR3_PVDEN);
}

/**
  * @brief  Indicate whether the VDD voltage level is between, above or below the threshold.
  * @retval VDD level which can be PWR_NO_VDD_MEASUREMENT_AVAILABLE / PWR_VDD_BELOW_THRESHOLD /
  *         PWR_VDD_ABOVE_OR_EQUAL_THRESHOLD
  */
uint32_t HAL_PWR_GetPVDRange(void)
{
  uint32_t regValue = PWR->CR3;

  /* check VDDcore monitoring is ON */
  if ((regValue & PWR_CR3_PVDEN) != PWR_CR3_PVDEN)
  {
    return PWR_NO_VDD_MEASUREMENT_AVAILABLE;
  }

  /* check VDDcore level */
  if ((regValue & PWR_CR3_PVDO) == PWR_CR3_PVDO)
  {
    return PWR_VDD_BELOW_THRESHOLD;
  }
  else
  {
    return PWR_VDD_ABOVE_OR_EQUAL_THRESHOLD;
  }
}

/**
  * @brief  This function handles the PWR PVD interrupt request.
  * @note   This API should be called under the PVD_IRQHandler().
  * @retval None
  */
void HAL_PWR_PVD_IRQHandler(void)
{
  if (HAL_PWR_GetPVDRange() == PWR_VDD_BELOW_THRESHOLD)
  {
    HAL_PWR_PVD_LowerCallback();
  }
  else
  {
    HAL_PWR_PVD_EqualHigherCallback();
  }

  /* Clear PWR PVD EXTI pending bit */
  __HAL_PWR_PVD_EXTI_CLEAR_FLAG();
}

/**
  * @brief  PWR PVD interrupt callback
  * @retval None
  */
__weak void HAL_PWR_PVD_EqualHigherCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWR_PVD_EqualHigherCallback could be implemented in the user file
   */
}
__weak void HAL_PWR_PVD_LowerCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWR_PVD_LowerCallback could be implemented in the user file
   */
}
#endif /* defined(CORE_CM33)||defined(CORE_CA35) */

#if defined(PWR_D3WKUPENR_TAMP_WKUPEN_D3)
#if !defined(CORE_CM0PLUS)
/*Below all fct to manage D3 wake-up from VBAT mode (ePOS) thru non secure TAMPERs, only M33/A35 can access
  PWR register for this configuration*/

/**
  * @brief Enable D3 wake-up from TAMPERs event when system is in VBAT mode, mandatory if ePOS mode targeted
  * @arg    None
  * @retval None
  */
void HAL_PWR_EnableD3WakeUpTamper(void)
{
  /*setting at PWR IP level */
  SET_BIT(PWR->D3WKUPENR, PWR_D3WKUPENR_TAMP_WKUPEN_D3);
}

/**
  * @brief Disable D3 wake-up from TAMPERs event when system is in VBAT mode
  * @arg    None
  * @retval None
  */
void HAL_PWR_DisableD3WakeUpTamper(void)
{
  /* disable at PWR IP level, D3 wake-up thru tamper event*/
  CLEAR_BIT(PWR->D3WKUPENR, PWR_D3WKUPENR_TAMP_WKUPEN_D3);
}

/**
  * @brief return true if D3 can be wakeup from VBat mode thru  TAMPERs event
  * @retval None
  */
uint32_t HAL_PWR_IsTamperD3WakeUpCapable(void)
{
  return ((PWR->D3WKUPENR & PWR_D3WKUPENR_TAMP_WKUPEN_D3) == PWR_D3WKUPENR_TAMP_WKUPEN_D3) ? 1U : 0U;
}

#endif /*if !defined(CORE_CM0PLUS)*/
#endif /* defined(PWR_D3WKUPENR_TAMP_WKUPEN_D3) */
/* end of fct to manage D3 wake-up from Vbat mode thru non-secure TAMPERs*/


