zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pwr.c
#if !defined(CORE_CM0PLUS)
/*Below all fct to manage POWER WK-UP line */

/**
  * @brief Enable the WakeUp PINx functionality
  * @note Enable wake up from standby mechanism with CPU#i_WAKEUP_PIN_IRQn generation
  * @note wakeup pin from stand-by are one of the 6 wakeup line of PWR IP
  *
  * @note Note that handling of interruption (nvic/gic enable, priority setting callback) is out of scope of this
  * @note function and is under caller responsibility BUT as this interruption may wake-up from standby,
  * @note user shall take care that event is not lost
  * @note when GIC/NVIC is powered again (GIC/NVIC  shall be level sensitive ). For same standby exit purpose,
  * @note this function does not clear PWR WAKEUP line status, otherwise no wakeup event detected at
  * @note CPU level on standby exit.
  * @param WakeUpPinPolarity: Specifies on which edge  of Wake-Up pin detection is done
  *                           @arg PWR_WAKEUP_HIGH
  *                           @arg PWR_WAKEUP_LOW
  *                           @arg Specifies which pull configuration to set on  Wake-Up pin
  *                                 This parameter can be no pull edge   or  pull up or  pull down :
  *                           @arg  PWR_WAKEUP_NOPULL
  *                           @arg  PWR_WAKEUP_PULLUP
  *                           @arg  PWR_WAKEUP_PULLDOWN
  *                           @arg  Specifies the Power Wake-Up pin.This parameter can be one of the following values:
  *                           @arg PWR_WAKEUP_PIN_ID1
  *                           @arg PWR_WAKEUP_PIN_ID2
  *                           @arg PWR_WAKEUP_PIN_ID3
  *                           @arg PWR_WAKEUP_PIN_ID4
  *                           @arg PWR_WAKEUP_PIN_ID5
  *                           @arg PWR_WAKEUP_PIN_ID6
  * to keep compatibility with legacy API, this 3 parameters are gathered into one uint32_t polarity param
  * @retval None
  */
void HAL_PWR_EnableWakeUpPin(uint32_t WakeUpPinPolarity)
{
  __IO uint32_t *regaddr;
  uint32_t WakeUpPinEdge = ((WakeUpPinPolarity & PWR_WAKEUP_EDGE_MASK) >> PWR_WAKEUP_EDGE_POS);
  uint32_t WakeUpPinConfiguration = ((WakeUpPinPolarity & PWR_WAKEUP_PULL_MASK) >> PWR_WAKEUP_PULL_POS);
  uint32_t WakeUpPinx = ((WakeUpPinPolarity & PWR_WAKEUP_PIN_ID_MASK) >> PWR_WAKEUP_PIN_ID_POS);

  assert_param(IS_PWR_WAKEUP_PIN_ID(WakeUpPinx));
  assert_param(IS_PWR_WAKEUP_PIN_CONFIG(WakeUpPinConfiguration));
  assert_param(IS_PWR_WAKEUP_PIN_EDGE(WakeUpPinEdge));

  /*setting at PWR IP level */
  regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx); /* Selected register corresponding to input wakeup line*/
  CLEAR_BIT(*regaddr, PWR_CPU_TO_WAKE_UP);                    /* Disable WKUP pinx interruption on current CPU */
  /* Set edge  configuration for wake-up pin*/
  MODIFY_REG(*regaddr, PWR_WKUPCR1_WKUPP, WakeUpPinEdge << PWR_WKUPCR1_WKUPP_Pos);
  /* Set pull  configuration for wake-up pin*/
  MODIFY_REG(*regaddr, PWR_WKUPCR1_WKUPPUPD, WakeUpPinConfiguration << PWR_WKUPCR1_WKUPPUPD_Pos);

  SET_BIT(*regaddr, PWR_CPU_TO_WAKE_UP); /* Enable  WKUP pinx interruption on current CPU */
}
#endif /*!defined(CORE_CM0PLUS)*/


#if !defined(CORE_CM0PLUS)
/**
  * @brief Disables the WakeUp PINx functionality.*
  * @note wakeup pin from stand-by are one of the 6 wakeup line of PWR IP
  * @param WakeUpPinx: Specifies the Power Wake-Up pin.
  *         This parameter can be one of the following values:
  *           @arg PWR_WAKEUP_PIN_ID1
  *           @arg PWR_WAKEUP_PIN_ID2
  *           @arg PWR_WAKEUP_PIN_ID3
  *           @arg PWR_WAKEUP_PIN_ID4
  *           @arg PWR_WAKEUP_PIN_ID5
  *           @arg PWR_WAKEUP_PIN_ID6
  * @retval None
  */
void HAL_PWR_DisableWakeUpPin(uint32_t WakeUpPinx)
{
  __IO uint32_t *regaddr;

  assert_param(IS_PWR_WAKEUP_PIN_ID(WakeUpPinx));
  /*Disable  at EXTI IP level */
  regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx); /*selected register corresponding to input wakeup line*/
  CLEAR_BIT(*regaddr, PWR_CPU_TO_WAKE_UP);
}
#endif /*!defined(CORE_CM0PLUS)*/


#if !defined(CORE_CM0PLUS)
/**
  * @brief return wakeup capability status of a wakeup event
  * @note wakeup pin from stand-by are one of the 6 wakeup line of PWR IP
  * @param WakeUpPinx: Specifies the Power Wake-Up pin.
  *         This parameter can be one of the following values:
  *           @arg PWR_WAKEUP_PIN_ID1
  *           @arg PWR_WAKEUP_PIN_ID2
  *           @arg PWR_WAKEUP_PIN_ID3
  *           @arg PWR_WAKEUP_PIN_ID4
  *           @arg PWR_WAKEUP_PIN_ID5
  *           @arg PWR_WAKEUP_PIN_ID6
  * @retval None
  */
uint32_t HAL_PWR_IsWakeUpCapable(uint32_t WakeUpPinx)
{
  const __IO uint32_t *regaddr;

  assert_param(IS_PWR_WAKEUP_PIN_ID(WakeUpPinx));
  /*selected register corresponding to input wakeup line*/
  regaddr = (__IO uint32_t *)(&PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx));
  return ((*regaddr & PWR_CPU_TO_WAKE_UP) == PWR_CPU_TO_WAKE_UP) ? 1U : 0U;
}
#endif /*!defined(CORE_CM0PLUS)*/


#if !defined(CORE_CM0PLUS)
/**
  * @brief unmask at EXTI level and for current CPU, EXTI_IRQn interruption associated to  wakeup pin  input parameter.
  *
  * @note Note that handling of interruption (nvic/gic enable, priority setting callback) is out of scope
  * @note of this function and is under caller responsibility
  * @note connected to EXTI2 in direct event type B
  * @note when current CPU is A35 or M33 , wakeup event are one of 6 wakeup-line of PWR IP
  * @note connected to EXTI1 in direct event type B
  * @param WakeUpPinx: Specifies the Power Wake-Up pin.
  *         This parameter can be one of the following values:
  *           @arg PWR_WAKEUP_PIN_ID1
  *           @arg PWR_WAKEUP_PIN_ID2
  *           @arg PWR_WAKEUP_PIN_ID3
  *           @arg PWR_WAKEUP_PIN_ID4
  *           @arg PWR_WAKEUP_PIN_ID5
  *           @arg PWR_WAKEUP_PIN_ID6
  * @retval None
  */
void HAL_PWR_EnableWakeUpExtiIT(uint32_t WakeUpPinx)
{
  assert_param(IS_PWR_WAKEUP_PIN_ID(WakeUpPinx));

  /*wake-up line connected on EXTI1, line 52 to 57*/
  __HAL_WKUP_EXTI_ENABLE_IT(extiImr2WakeUp[WakeUpPinx]);
}
#endif /*!defined(CORE_CM0PLUS)*/


