zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pwr.c
#if !defined(CORE_CM0PLUS)
/**
  * @brief mask WakeUp PINx Interrupt at EXTI level for current CPU.
  * @param WakeUpPinx: Specifies the Power Wake-Up pin.
  *         This parameter can be one of the following values:
  *           @arg PWR_WAKEUP_PIN_ID1
  *           @arg PWR_WAKEUP_PIN_ID2
  *           @arg PWR_WAKEUP_PIN_ID3
  *           @arg PWR_WAKEUP_PIN_ID4
  *           @arg PWR_WAKEUP_PIN_ID5
  *           @arg PWR_WAKEUP_PIN_ID6
  */
void HAL_PWR_DisableWakeUpExtiIT(uint32_t WakeUpPinx)
{
  /*wake-up line connected on EXTI1, line 52 to 57*/
  assert_param(IS_PWR_WAKEUP_PIN_ID(WakeUpPinx));
  __HAL_WKUP_EXTI_DISABLE_IT(extiImr2WakeUp[WakeUpPinx]);
}
#endif /*!defined(CORE_CM0PLUS)*/


#if !defined(CORE_CM0PLUS)
/**
  * @brief Return  WakeUp PINx capability at EXTI level for current CPU.
  * @param WakeUpPinx: Specifies the Power Wake-Up pin.
  *         This parameter can be one of the following values:
  *           @arg PWR_WAKEUP_PIN_ID1
  *           @arg PWR_WAKEUP_PIN_ID2
  *           @arg PWR_WAKEUP_PIN_ID3
  *           @arg PWR_WAKEUP_PIN_ID4
  *           @arg PWR_WAKEUP_PIN_ID5
  *           @arg PWR_WAKEUP_PIN_ID6
  * @retval None
  */
uint32_t HAL_PWR_IsWakeUpExtiCapable(uint32_t WakeUpPinx)
{
  /*wake-up line connected on EXTI1, line 52 to 57*/
  assert_param(IS_PWR_WAKEUP_PIN_ID(WakeUpPinx));
  return (__HAL_WKUP_EXTI_BIT_IT(extiImr2WakeUp[WakeUpPinx]));
}
#endif /*!defined(CORE_CM0PLUS)*/


/**
  * @brief Return PWR state of a CPU
  * @retval return PWR_CPU_CRESET,PWR_CPU_CRUN,PWR_CPU_CSLEEP,PWR_CPU_CSTOP
  */
uint32_t HAL_PWR_CPU1State(void)
{
  return ((PWR->CPU1D1SR & PWR_CPU1D1SR_CSTATE_Msk) >> PWR_CPU1D1SR_CSTATE_Pos);
}
uint32_t HAL_PWR_CPU2State(void)
{
  return ((PWR->CPU2D2SR & PWR_CPU2D2SR_CSTATE_Msk) >> PWR_CPU2D2SR_CSTATE_Pos);
}
#if defined(PWR_CPU3D3SR_CSTATE)
uint32_t HAL_PWR_CPU3State(void)
{
  return ((PWR->CPU3D3SR & PWR_CPU3D3SR_CSTATE_Msk) >> PWR_CPU3D3SR_CSTATE_Pos);
}
#endif /* defined(PWR_CPU3D3SR_CSTATE) */
/**
  * @brief Return PWR state of a power D1 domain
  * @retval return PWR_D1_DRUN, PWR_D1_DSTOP1, PWR_D1_DSTOP2, PWR_D1_DSTOP3, PWR_D1_DSTANDBY
  */
uint32_t HAL_PWR_D1State(void)
{
  return ((PWR->CPU1D1SR & PWR_CPU1D1SR_DSTATE_Msk) >> PWR_CPU1D1SR_DSTATE_Pos);
}

/**
  * @brief Return PWR state of a power D2 domain
  * @retval return PWR_D2_RUN, PWR_D2_STOP, PWR_D2_LP_STOP, PWR_D2_LPLVSTOP2, PWR_D2_STANDBY, PWR_D2_VBAT
  */
uint32_t HAL_PWR_D2State(void)
{
  return ((PWR->CPU2D2SR & PWR_CPU2D2SR_DSTATE_Msk) >> PWR_CPU2D2SR_DSTATE_Pos);
}

#if defined(PWR_CPU3D3SR_DSTATE)
/**
  * @brief Return PWR state of a power D3 domain
  * @retval return PWR_D3_SRUN1, PWR_D3_SRUN2, PWR_D3_SRUN3, PWR_D3_SSTOP1, PWR_D3_SSTOP2, PWR_D3_SSTANDBY
  */
uint32_t HAL_PWR_D3State(void)
{
  return ((PWR->CPU3D3SR & PWR_CPU3D3SR_DSTATE_Msk) >> PWR_CPU3D3SR_DSTATE_Pos);
}
#endif /* defined(PWR_CPU3D3SR_DSTATE) */

/**
  * @brief Return true if D#i domain has been in idle mode since last reset
  * @retval return 0 if answer is false, not 0 if answer is true
  */
uint32_t HAL_PWR_HasD1BeenInStandby(void)
{
  return (__HAL_PWR_GET_FLAG(PWR_FLAG_SB_D1)) ? 1U : 0U;
}

uint32_t HAL_PWR_HasD2BeenInStandby(void)
{
  return (__HAL_PWR_GET_FLAG(PWR_FLAG_SB_D2)) ? 1U : 0U;
}

uint32_t HAL_PWR_HasD3BeenInStandby(void)
{
  return (__HAL_PWR_GET_FLAG(PWR_FLAG_SB_D3)) ? 1U : 0U;
}

/**
  * @brief Return true if system wakes-up from standby (a reset occurs for system wake-up)
  * @retval return 0 if answer is false, not 0 if answer is true
  */
uint32_t HAL_PWR_HasSystemBeenInStandby(void)
{
#if defined(CORE_CA35) || defined(CORE_CM33)
  return (__HAL_PWR_GET_FLAG(PWR_FLAG_SB)) ? 1U : 0U;
#else
  return (__HAL_PWR_GET_FLAG(PWR_FLAG_SB_D3));
#endif /* defined(CORE_CA35) || defined(CORE_CM33) */
}


/**
  * @brief Return true if system  was in VBAT mode
  * @retval return 0 if answer is false, not 0 if answer is true
  */
uint32_t HAL_PWR_HasSystemBeenInVBAT(void)
{
  return (__HAL_PWR_GET_FLAG(PWR_FLAG_VB)) ? 1U : 0U;
}


#if defined(CORE_CM33)||defined(CORE_CA35)
/**
  * @brief Return true if system wakes-up from cstop
  * @retval return 0 if answer is false, not 0 if answer is true
  */
uint32_t HAL_PWR_HasSystemBeenInStop(void)
{
  return (__HAL_PWR_GET_FLAG(PWR_FLAG_STOP)) ? 1U : 0U;
}
#endif /* defined(CORE_CM33)||defined(CORE_CA35) */


/**
  * @brief Enters Sleep mode.
  *
  * @note In Sleep mode, all I/O pins keep the same state as in Run mode.
  *
  * @note In Sleep mode, STM32MP2 PWR module does not allow any update of voltage regulator value:
  * @note Regulators are ON without any low power neither low voltage feature.
  * @note However, for compatibility reason, there is still a regulator argument
  *
  * @note In Sleep mode, the systick can be  stopped to avoid exit from this mode with
  *       systick interrupt when used as time base for Timeout

  * @param Regulator : unused variable but to keep compatibility with legacy API
  * @param SLEEPEntry: Specifies if SLEEP mode in entered with WFI or WFE instruction.
  *          This parameter can be one of the following values:
  *            @arg PWR_SLEEPENTRY_WFI: enter SLEEP mode with WFI instruction
  *            @arg PWR_SLEEPENTRY_WFE: enter SLEEP mode with WFE instruction
  * @retval None
  */
void HAL_PWR_EnterSLEEPMode(__attribute__((unused))uint32_t Regulator, uint8_t SLEEPEntry)
{
  /* Check the parameters */
  assert_param(IS_PWR_SLEEP_ENTRY(SLEEPEntry));

  /* Ensure core do not enter to CSTOP mode (on sleep, only core clock is gated, do not gate subsystem core clock) */
  KeepCortexSubsystemClockOnSleepEntry();

  /*check  request to system standby not set*/
  ClearStandbyRequest();

  /* Select SLEEP mode entry -------------------------------------------------*/
  if (SLEEPEntry == PWR_SLEEPENTRY_WFI)
  {
    /* Request Wait For Interrupt */
    __WFI();
  }
  else
  {
    /* Request Wait For Event */
    __SEV();
    __WFE();
    __WFE();
  }
}


/**
  * @brief Enters CSTOP/STOP mode.
  * @note In Stop mode, all I/O pins keep the same state as in Run mode.
  * @note When exiting Stop mode by issuing an interrupt or a wake up event,
  * @note the HSI oscillator is selected as system clock.
  * @note When the voltage regulator operates in low power mode, an additional
  * @note startup delay is incurred when waking up from Stop mode.
  * @note By keeping the internal regulator ON during Stop mode, the consumption
  * @note is higher although the startup time is reduced.
  * @param Regulator: Specifies which power state regulator supplying current CPU domain can reach
  *            This parameter can be one of the following values:
  *            @arg PWR_REGULATOR_LP_OFF i.e. full power
  *            @arg PWR_REGULATOR_LP_ON_LV_OFF i.e. can be low power but nominal voltage
  *            @arg PWR_REGULATOR_LP_ON_LV_ON  i.e. can be low power and  low voltage
  * @param STOPEntry: Specifies if Stop mode in entered with WFI or WFE instruction.
  *          This parameter can be one of the following values:
  *            @arg PWR_STOPENTRY_WFI: Enter Stop mode with WFI instruction
  *            @arg PWR_STOPENTRY_WFE: Enter Stop mode with WFE instruction
  * @retval None
  */
void HAL_PWR_EnterSTOPMode(uint32_t Regulator, uint8_t STOPEntry)
{
  /* Check the parameters */
  assert_param(IS_PWR_STOP_MODE_REGULATOR(Regulator));
  assert_param(IS_PWR_STOP_ENTRY(STOPEntry));

