zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pwr.c
  /*indicate  which power saving  can be done when cpu is in stop mode*/
  SetRegulatorStopModeIndicator(Regulator);

  /*check  request to system standby not set*/
  ClearStandbyRequest();

  /* Ensure core enters in  CSTOP mode on sleep (core and core-subsystem  clock are gated) */
  GateCortexSubsystemClockOnSleepEntry();

  /* Select Stop mode entry --------------------------------------------------*/
  if ((STOPEntry == PWR_STOPENTRY_WFI))
  {
    /* Request Wait For Interrupt */
    __WFI();
  }
  else if (STOPEntry == PWR_STOPENTRY_WFE)
  {
    /* Request Wait For Event */
    __SEV();
    __WFE();
    __WFE();
  }
  else
  {
    /* do nothing */
  }
  /*remove any low power indication for regulator when CPU is in stop mode
    not mandatory as low power PWR output signal are not active when system is in RUN mode,
    but cleaner  to clear these bit inside PWR register*/
  ClearRegulatorStopModeIndicator();

  /* remove 'clock gating on sleep entry' request  */
  KeepCortexSubsystemClockOnSleepEntry();
}

#if defined(CORE_CM33)||defined(CORE_CA35)
/**
  * @brief Enters MPU CStandby / MCU CSTOP allowing system Standby mode.
  * @param STANDBYType: Specifies standby mode that can be reached
  *            This parameter can be one of the following values:
  *            @arg PWR_STANDBY_1 i.e. D3 still open (but D1 and D2 OFF)
  *            @arg PWR_STANDBY_2 i.e. D3 and D2 and D1 OFF
  * @retval None
  */
void HAL_PWR_EnterSTANDBYMode(uint8_t STANDBYType)
{
  /* Check the parameters */
  assert_param(IS_PWR_STANDBY_TYPE(STANDBYType));

  /*Indicate to regulator which power saving  can be done when cpu is in stop mode and allow clock gating*/
  /*useful in case standby is not granted but instead  cstop */
  SetRegulatorStopModeIndicator(PWR_REGULATOR_LP_ON_LV_ON);
  GateCortexSubsystemClockOnSleepEntry();

  /*set request to allow system standby*/
  SetStandbyRequest(STANDBYType);


  /* This option is used to ensure that store operations are completed */
#if defined ( __CC_ARM)
  __force_stores();
#endif /* __CC_ARM */
  /* Request Wait For Interrupt */
  __WFI();

  /*
  code below is never reached in case STD-BY is granted by PWR but
  only in case of wake-up from sleep/stop (case STD-BY not granted due to other cores activities
  */

  /*remove CPU regulator from power saving state*/
  /*not mandatory as low power PWR output signal are not active when system is in RUN mode,
    but cleaner  to clear these bit inside PWR register*/
  ClearRegulatorStopModeIndicator();

  /* remove 'clock gating on sleep entry' request  */
  KeepCortexSubsystemClockOnSleepEntry();

  /*clear request to allow system standby*/
  ClearStandbyRequest();

}
#endif /*defined(CORE_CM33)||defined(CORE_CA35)*/


/**
  * @brief Indicates Sleep-On-Exit when returning from Handler mode to Thread mode.
  * @note Set SLEEPONEXIT bit of SCR register. When this bit is set, the processor
  *       re-enters IDLE/WFI mode when an interruption handling is over (cortex M)
  *       Setting this bit is useful when the processor is expected to run only on
  *       interruptions handling.
  * @retval None
  */
#if defined(CORE_CM33)||defined(CORE_CM0PLUS)
void HAL_PWR_EnableSleepOnExit(void)
{
  /* Set SLEEPONEXIT bit of Cortex System Control Register */
  SET_BIT(SCB->SCR, ((uint32_t)SCB_SCR_SLEEPONEXIT_Msk));
  /* Ensure cortexM do not enter to CSTOP mode (do not gate core-subsystem clock when cpu enters sleep mode) */
  KeepCortexSubsystemClockOnSleepEntry();
  /*insure standby request not set*/
  ClearStandbyRequest();
}
#endif /* defined(CORE_CM33)||defined(CORE_CM0PLUS) */

/**
  * @brief Disables Sleep-On-Exit feature when returning from Handler mode to Thread mode.
  * @note Clears SLEEPONEXIT bit of SCR register.
  * @retval None
  */
#if defined(CORE_CM33)||defined(CORE_CM0PLUS)
void HAL_PWR_DisableSleepOnExit(void)
{
  /* Clear SLEEPONEXIT bit of Cortex System Control Register */
  CLEAR_BIT(SCB->SCR, ((uint32_t)SCB_SCR_SLEEPONEXIT_Msk));
}
#endif /* defined(CORE_CM33)||defined(CORE_CM0PLUS) */

/**
  * @brief Indicates Stop-On-Exit when returning from Handler mode to Thread mode.
  * @note Set SLEEPONEXIT bit of SCR register. When this bit is set, the processor
  *       re-enters IDLE/WFA mode when an interruption handling is over (cortex M)
  *       Setting this bit is useful when the processor is expected to run only on
  *       interruptions handling.
  * @retval None
  */
#if defined(CORE_CM33)||defined(CORE_CM0PLUS)
void HAL_PWR_EnableStopOnExit(uint32_t Regulator)
{
  /*Indicate to regulator which power saving  can be done when cpu is in stop mode*/
  SetRegulatorStopModeIndicator(Regulator);
  /* Set SLEEPONEXIT bit of Cortex System Control Register */
  SET_BIT(SCB->SCR, ((uint32_t)SCB_SCR_SLEEPONEXIT_Msk));
  /* Ensure cortexM subsystem  clock is  gated when cpu enters sleep mode) */
  GateCortexSubsystemClockOnSleepEntry();
  /*insure standby request not set*/
  ClearStandbyRequest();
}
#endif /* defined(CORE_CM33)||defined(CORE_CM0PLUS) */

/**
  * @brief Disables stop-On-Exit feature when returning from Handler mode to Thread mode.
  * @note Clears SLEEPONEXIT bit of SCR register.
  * @retval None
  */
#if defined(CORE_CM33)||defined(CORE_CM0PLUS)
void HAL_PWR_DisableStopOnExit(void)
{
  /* Clear SLEEPONEXIT bit of Cortex System Control Register */
  CLEAR_BIT(SCB->SCR, ((uint32_t)SCB_SCR_SLEEPONEXIT_Msk));
  /* clear automatic cortex subsystem clock gating on sleep entry*/
  KeepCortexSubsystemClockOnSleepEntry();
  /*remove any low power indication for regulator when CPU is in stop mode*/
  /*not mandatory as low power PWR output signal are not active when system is in RUN mode,
    but cleaner  to clear these bit inside PWR register*/
  ClearRegulatorStopModeIndicator();
}
#endif /*(CORE_CM33)||defined(CORE_CM0PLUS)*/


/**
  * @brief set CPU regulator constraint when cpu is in stop mode
  * @note not relevant if cpu is M0+
  * @retval None
  */
void SetRegulatorStopModeIndicator(uint32_t Regulator)
{
#if defined(CORE_CM0PLUS)
  UNUSED(Regulator);
#else /* CORE_CM0PLUS */
#ifdef CORE_CA35
#define LP_LV_SET_MSK (PWR_CPU1CR_LPDS_D1_Msk|PWR_CPU1CR_LVDS_D1_Msk)
#define REGU_SHIFT_SET PWR_CPU1CR_LPDS_D1_Pos
  __IO uint32_t *regaddr = &PWR->CPU1CR;
#endif /*CORE_CA35*/
#ifdef CORE_CM33
#define LP_LV_SET_MSK (PWR_CPU2CR_LPDS_D2_Msk|PWR_CPU2CR_LVDS_D2_Msk)
#define REGU_SHIFT_SET PWR_CPU2CR_LPDS_D2_Pos
  __IO uint32_t *regaddr = &PWR->CPU2CR;
#endif /*CORE_CM33*/

  /* Check  parameter */
  assert_param(IS_PWR_STOP_MODE_REGULATOR(Regulator));
  *regaddr = ((*regaddr & (~LP_LV_SET_MSK)) | (Regulator << REGU_SHIFT_SET));
#endif /* CORE_CM0PLUS */
}


/**
  * @brief clear CPU regulator constraint when cpu is in stop mode
  * @note thru this API CPU removes any  low power assertion on its domain regulator
  * @retval None
  */
void ClearRegulatorStopModeIndicator()
{
#ifdef CORE_CA35
#define LP_LV_CLR_MSK (PWR_CPU1CR_LPDS_D1_Msk|PWR_CPU1CR_LVDS_D1_Msk)
#define REGU_SHIFT_CLR PWR_CPU1CR_LPDS_D1_Pos
  MODIFY_REG(PWR->CPU1CR, LP_LV_CLR_MSK, PWR_REGULATOR_LP_OFF << REGU_SHIFT_CLR);
#endif /*  CORE_CA35 */
#ifdef CORE_CM33
#define LP_LV_CLR_MSK (PWR_CPU2CR_LPDS_D2_Msk|PWR_CPU2CR_LVDS_D2_Msk)
#define REGU_SHIFT_CLR PWR_CPU2CR_LPDS_D2_Pos
  MODIFY_REG(PWR->CPU2CR, LP_LV_CLR_MSK, PWR_REGULATOR_LP_OFF << REGU_SHIFT_CLR);
#endif /* CORE_CM33 */
}


/**
  * @brief request to gate cortex subsystem clock (e.g. GIC/NVIC, cache, ..) when CPU enters sleep mode
  * @retval None
  */
void GateCortexSubsystemClockOnSleepEntry(void)
{
#if defined(CORE_CM33)||defined(CORE_CM0PLUS)
  /* Set DEEP SLEEP bit of Cortex System Control Register */
  SET_BIT(SCB->SCR, SCB_SCR_SLEEPDEEP_Msk);
#else
  __HAL_RCC_ALLOW_CSTOP();
#endif /* defined(CORE_CM33)||defined(CORE_CM0PLUS) */
}


/**
  * @brief forbid  gating of cortex subsystem clock (e.g. GIC/NVIC, cache, ..) when CPU enters sleep mode
  * @retval None
  */
void KeepCortexSubsystemClockOnSleepEntry(void)
{
#if defined(CORE_CM33)||defined(CORE_CM0PLUS)
  /* clear DEEP SLEEP bit of Cortex System Control Register */
  CLEAR_BIT(SCB->SCR, SCB_SCR_SLEEPDEEP_Msk);
#else
  __HAL_RCC_PREVENT_CSTOP();
#endif /* defined(CORE_CM33)||defined(CORE_CM0PLUS) */
}

/**
  * @brief forbid  system to go in any standby mode
  * @retval None
  */
void ClearStandbyRequest(void)
{
#ifdef CORE_CA35
  CLEAR_BIT(PWR->CPU1CR, SYSTEM_STANDBY_REQUEST);
  CLEAR_BIT(PWR->CPU1CR, DOMAIN2_STANDBY_REQUEST);
#if defined(PWR_D3CR_PDDS_D3)
  CLEAR_BIT(PWR->D3CR, PWR_D3CR_PDDS_D3);
#endif /* defined(PWR_D3CR_PDDS_D3) */
#endif /* CORE_CA35 */
#ifdef CORE_CM33
  CLEAR_BIT(PWR->CPU2CR, SYSTEM_STANDBY_REQUEST);
#if defined(PWR_D3CR_PDDS_D3)
  CLEAR_BIT(PWR->D3CR, PWR_D3CR_PDDS_D3);
#endif /* defined(PWR_D3CR_PDDS_D3) */
#endif /* CORE_CM33 */
}


#if defined(CORE_CM33)||defined(CORE_CA35)
/**
  * @brief request   system to go in any standby mode
  * @note Beware request may not be granted by PWR (case activity on others CPUs)
  * @retval None
  */
void SetStandbyRequest(uint8_t STANDBYType)
{
  /*clear all standby flag, mandatory otherwise  standby flags are not relevant  at reset (except if reset is pon !)*/
  __HAL_PWR_CLEAR_FLAG();

