zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pwr.c
  /* set CPU system standby authorization*/
#ifdef CORE_CA35
  SET_BIT(PWR->CPU1CR, SYSTEM_STANDBY_REQUEST);
  SET_BIT(PWR->CPU1CR, DOMAIN2_STANDBY_REQUEST);   /*MPU power constraint on D2 domain*/
#endif /* CORE_CA35 */
#ifdef CORE_CM33
  SET_BIT(PWR->CPU2CR, SYSTEM_STANDBY_REQUEST);
#endif /* CORE_CM33 */
#if defined(PWR_D3CR_PDDS_D3)
  if (STANDBYType == PWR_STANDBY_2)
    /*if standby2 is requested, CPU shall set D3 domain standby authorization*/
  {
    SET_BIT(PWR->D3CR, PWR_D3CR_PDDS_D3);
  }
#endif /* defined(PWR_D3CR_PDDS_D3) */
}
#endif /*defined(CORE_CM33)||defined(CORE_CA35)*/

/**
  * @brief Enables CORTEX SEVONPEND bit.
  * @note Sets SEVONPEND bit of SCR register. When this bit is set, pending
  * interruptions (even if interruption disable) can wakeup processor (cortexM) from WFE
  * @retval None
  */
#if defined(CORE_CM33)||defined(CORE_CM0PLUS)
void HAL_PWR_EnableSEVOnPend(void)
{
  /* Set SEVONPEND bit of Cortex System Control Register */
  SET_BIT(SCB->SCR, ((uint32_t)SCB_SCR_SEVONPEND_Msk));
}
#endif /* defined(CORE_CM33)||defined(CORE_CM0PLUS) */

/**
  * @brief Disables CORTEX SEVONPEND bit.
  * @note Clears SEVONPEND bit of SCR register. When this bit is clear, pending
  * interruptions (even if interruption disable) cannot wakeup processor (cortexM) from WFE
  * @retval None
  */
#if defined(CORE_CM33)||defined(CORE_CM0PLUS)
void HAL_PWR_DisableSEVOnPend(void)
{
  /* Clear SEVONPEND bit of Cortex System Control Register */
  CLEAR_BIT(SCB->SCR, ((uint32_t)SCB_SCR_SEVONPEND_Msk));
}
#endif /* defined(CORE_CM33)||defined(CORE_CM0PLUS) */

/**
  * @brief  Configure RIF attribute of a WIO pin bitmap.
  *         Available RIF attributes are CID, security and privilege protection.
  *         RIF attribute is applied on all pins of input param bitmap.
  * @note   If no CID attribute provide, CID filtering is disabled.
  * @param  Resource : wake-up io pin bitmap.
  * @param  ResourceAttributes: RIF (CID/secure/privilege) attributes.

  * @retval HAL Status.

  */
HAL_StatusTypeDef HAL_PWR_ConfigWioResourceAttributes(uint16_t Resource, uint32_t ResourceAttributes)
{
  uint32_t position = 0x00;
  uint32_t iocurrent;
  __IO uint32_t *regaddr;

  /* Check the parameters */
  assert_param(IS_WIO_RESOURCE(Resource));
  assert_param(IS_WIO_PIN_ATTRIBUTES(ResourceAttributes));

  /* Configure WIO pin(s) */
  while (((Resource >> WIO_RESOURCE_POS) >> position) != 0U)
  {
    /* Get current io position */
    iocurrent = ((uint32_t)Resource >> WIO_RESOURCE_POS) & (1UL << position);
    if (iocurrent != 0U)
    {
#if defined (CORTEX_IN_SECURE_STATE)
      if ((ResourceAttributes & WIO_PIN_ATTR_SEC_SELECT) == WIO_PIN_ATTR_SEC_SELECT)
      {
        /* Configure secure/non-secure attribute */
        if ((ResourceAttributes & WIO_PIN_SEC) == WIO_PIN_SEC)
        {
          PWR->WIOSECCFGR |= iocurrent;
        }
        else
        {
          PWR->WIOSECCFGR &= (~iocurrent);
        }
      }
#endif /* CORTEX_IN_SECURE_STATE */
      if ((ResourceAttributes & WIO_PIN_ATTR_PRIV_SELECT) == WIO_PIN_ATTR_PRIV_SELECT)
      {
        /* Configure privilege/non-privilege attribute */
        if ((ResourceAttributes & WIO_PIN_PRIV) == WIO_PIN_PRIV)
        {
          PWR->WIOPRIVCFGR |= iocurrent;
        }
        else
        {
          PWR->WIOPRIVCFGR &= (~iocurrent);
        }
      }
      /* selected register corresponding to current WIO resource */
      regaddr = &PWR->WIO1CIDCFGR + (WIO_CID_CFG_ADD_OFFSET * position);

      *regaddr = 0;  /* remove any CID filtering on selected pin */
      if ((ResourceAttributes & (WIO_PIN_CID_DISABLE | WIO_PIN_ATTR_CID_STATIC_SELECT)) == \
          WIO_PIN_ATTR_CID_STATIC_SELECT)
        /* static CID field value used ONLY is CID filtering not disable */
      {
        /* Write static CID configuration */
        *regaddr = ((ResourceAttributes & PWR_WIO1CIDCFGR_SCID_Msk) | PWR_WIO1CIDCFGR_CFEN);
      }
      if ((ResourceAttributes & (WIO_PIN_CID_DISABLE | WIO_PIN_ATTR_CID_SHARED_SELECT)) == \
          WIO_PIN_ATTR_CID_SHARED_SELECT)
        /*shared CID field value used ONLY is CID filtering not disable */
      {
        /* Write shared CID configuration */
        *regaddr = ((ResourceAttributes & WIO_PIN_ATTR_CID_SHARED_MASK) | PWR_WIO1CIDCFGR_SEM_EN | \
                    PWR_WIO1CIDCFGR_CFEN);
      }
    }
    position++;
  }
  return HAL_OK;
}

/**
  * @brief  Get a RIF attributes a single WIO pin.
  * @note   In case input bitmap selects several pins, RIF attributes of first low rank pin is returned
  * @param  Resource : wake-up io pin bitmap, should select only ONE pin
  * @param  pResourceAttributes : pointer of  RIF attributes.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_PWR_GetConfigWioResourceAttributes(uint16_t Resource, uint32_t *pResourceAttributes)
{
  uint32_t position = 0x00;
  uint32_t iocurrent;
  __IO uint32_t *regaddr;

  /* Check null pointer */
  if (pResourceAttributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_WIO_RESOURCE(Resource));
  *pResourceAttributes = 0;

  /* Get rif attribute of the WIO pin */
  while (((Resource >> WIO_RESOURCE_POS) >> position) != 0U)
  {
    /* Get current io position */
    iocurrent = ((uint32_t)Resource >> WIO_RESOURCE_POS) & (1UL << position);

    if (iocurrent != 0U)
    {
#if defined (CORTEX_IN_SECURE_STATE)
      *pResourceAttributes |= ((PWR->WIOSECCFGR & iocurrent) == 0U) ? WIO_PIN_NSEC : WIO_PIN_SEC;
#endif /* CORTEX_IN_SECURE_STATE */
      *pResourceAttributes |= ((PWR->WIOPRIVCFGR & iocurrent) == 0U) ? WIO_PIN_NPRIV : WIO_PIN_PRIV;

      regaddr = &PWR->WIO1CIDCFGR + (WIO_CID_CFG_ADD_OFFSET * position);
      if ((*regaddr & PWR_WIO1CIDCFGR_CFEN_Msk) == PWR_WIO1CIDCFGR_CFEN)
      {
        if ((*regaddr & PWR_WIO1CIDCFGR_SEM_EN_Msk) == PWR_WIO1CIDCFGR_SEM_EN)
        {
          /* Get CIDs value from Semaphore white list */
          *pResourceAttributes |= ((WIO_PIN_ATTR_CID_SHARED_SELECT) |
                                   (((*regaddr)) & (WIO_PIN_ATTR_CID_SHARED_MASK)));
        }
        else
        {
          /* Get CIDs value from Static CID field */
          *pResourceAttributes |= (WIO_PIN_ATTR_CID_STATIC_SELECT | ((*regaddr) & PWR_WIO1CIDCFGR_SCID_Msk));
        }
      }
      else
      {
        *pResourceAttributes |= WIO_PIN_CID_DISABLE;
      }
      break;
    }
    position++;
  }

  return HAL_OK;
}

/**
  * @brief  Configure RIF attribute of a non shareable resource bitmap.
  *         Available RIF attributes are CID, security and privilege protection.
  *         RIF attribute is applied on all pins of input param bitmap.
  * @note   If no CID attribute provide, CID filtering is disabled.
  * @param  Resource : non shareable resource bitmap.
  * @param  ResourceAttributes: RIF (CID/secure/privilege) attributes.

  * @retval HAL Status.

  */
HAL_StatusTypeDef HAL_PWR_ConfigNonShareableResourceAttributes(uint16_t Resource, uint32_t ResourceAttributes)
{
  uint32_t position = 0x00;
  uint32_t iocurrent;
  __IO uint32_t *regaddr;

  /* Check the parameters */
  assert_param(IS_NS_RESOURCE(Resource));
  assert_param(IS_NS_RESOURCE_ATTRIBUTES(ResourceAttributes));

  /* Configure non shareable resource(s) */
  while (((Resource >> NS_RESOURCE_POS) >> position) != 0U)
  {
    /* Get current io position */
    iocurrent = ((uint32_t)Resource >> NS_RESOURCE_POS) & (1UL << position);
    if (iocurrent != 0U)
    {
#if defined (CORTEX_IN_SECURE_STATE)
      if ((ResourceAttributes & NS_RESOURCE_ATTR_SEC_SELECT) == NS_RESOURCE_ATTR_SEC_SELECT)
      {
        /* Configure secure/non-secure attribute */
        if ((ResourceAttributes & NS_RESOURCE_SEC) == NS_RESOURCE_SEC)
        {
          PWR->RSECCFGR |= iocurrent;
        }
        else
        {
          PWR->RSECCFGR &= (~iocurrent);
        }
      }
#endif /* CORTEX_IN_SECURE_STATE */
      if ((ResourceAttributes & NS_RESOURCE_ATTR_PRIV_SELECT) == NS_RESOURCE_ATTR_PRIV_SELECT)
      {
        /* Configure privilege/non-privilege attribute */
        if ((ResourceAttributes & NS_RESOURCE_PRIV) == NS_RESOURCE_PRIV)
        {
          PWR->RPRIVCFGR |= iocurrent;
        }
        else
        {
          PWR->RPRIVCFGR &= (~iocurrent);
        }
      }
      /* select register corresponding to current non-shareable resource */
      regaddr = &PWR->RxCIDCFGR[0] + (R_CID_CFG_ADD_OFFSET * position);
      *regaddr = 0;  /*remove any CID filtering on selected pin*/
      if ((ResourceAttributes & (NS_RESOURCE_CID_DISABLE | NS_RESOURCE_ATTR_CID_STATIC_SELECT)) ==
          NS_RESOURCE_ATTR_CID_STATIC_SELECT)
        /*static CID field value used ONLY is CID filtering not disable */
      {
        /* Write static CID configuration */
        *regaddr = ((ResourceAttributes & PWR_R0CIDCFGR_SCID_Msk) | PWR_R0CIDCFGR_CFEN);
      }
    }
    position++;
  }
  return HAL_OK;
}


/**
  * @brief  Get a RIF attributes a single non shareable resource.
  * @note   In case input bitmap selects several resource, RIF attributes of first low rank resource is returned
  * @param  Resource : non shareable resource bitmap, should select only ONE resource
  * @param  pResourceAttributes : pointer of  RIF attributes.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_PWR_GetConfigNonShareableResourceAttributes(uint16_t Resource, uint32_t *pResourceAttributes)
{
  uint32_t position = 0x00;
  uint32_t iocurrent;
  __IO uint32_t *regaddr;

  /* Check null pointer */
  if (pResourceAttributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_NS_RESOURCE(Resource));
  *pResourceAttributes = 0;

  /* Get rif attribute of the non-shareable resource */
  while (((Resource >> NS_RESOURCE_POS) >> position) != 0U)
  {
    /* Get current io position */
    iocurrent = ((uint32_t)Resource >> NS_RESOURCE_POS) & (1UL << position);

    if (iocurrent != 0U)
    {
#if defined (CORTEX_IN_SECURE_STATE)
      *pResourceAttributes |= ((PWR->RSECCFGR & iocurrent) == 0U) ? NS_RESOURCE_NSEC : NS_RESOURCE_SEC;
#endif /* CORTEX_IN_SECURE_STATE */
      *pResourceAttributes |= ((PWR->RPRIVCFGR & iocurrent) == 0U) ? NS_RESOURCE_NPRIV : NS_RESOURCE_PRIV;
      /* select register corresponding to current non-shareable resource */
      regaddr = &PWR->RxCIDCFGR[0] + (R_CID_CFG_ADD_OFFSET * position);
      if ((*regaddr & PWR_R0CIDCFGR_CFEN_Msk) == PWR_R0CIDCFGR_CFEN)
      {
        /* Get CIDs value from Static CID field */
        *pResourceAttributes |= (NS_RESOURCE_ATTR_CID_STATIC_SELECT | ((*regaddr) & PWR_R0CIDCFGR_SCID_Msk));
      }
      else
      {
        *pResourceAttributes |= NS_RESOURCE_CID_DISABLE;
      }
      break;
    }
    position++;
  }

  return HAL_OK;
}

/**
  * @brief  Attempt to acquire semaphore(s) of  WIO pin bitmap.
  * @note   In case of semaphore acquisition failure, returned status is HAL_KO and
            semaphore acquisition is abandoned  for all bitmap
  * @param  Item : wake-up io pin bitmap
  * @retval HAL Status, HAL_OK if semaphore acquisition for all pins of WIO_Pin is successful
  */
HAL_StatusTypeDef HAL_PWR_TakeResourceSemaphore(uint16_t Item)
{
  uint32_t position = 0x00;
  uint32_t iocurrent;
  uint32_t msk = 0x00;
  __IO uint32_t *regaddr;

  /* Check the parameters */
  assert_param(IS_WIO_RESOURCE(Item));

  /* Get secure attribute of the port pin */
  while (((Item >> WIO_RESOURCE_POS) >> position) != 0U)
  {
    /* Get current io position */
    iocurrent = ((uint32_t)Item >> WIO_RESOURCE_POS) & (1UL << position);
    if (iocurrent != 0U)
    {
      /* Take Semaphore*/
      regaddr = &PWR->WIO1SEMCR + (WIO_CID_CFG_ADD_OFFSET * position);
      *regaddr = PWR_WIO1SEMCR_SEM_MUTEX;
      if (((*regaddr) & PWR_WIO1SEMCR_SEMCID_Msk) != (PWR_WIO1SEMCR_SEMCID_CURRENT))
      {
        /* Mutex not taken with current CID - it means that other authorized CID has control,
           all previous acquired semaphores (if any) shall be released and status error is returned*/
        if ((((uint32_t)Item >> WIO_RESOURCE_POS) & msk) != 0U)
        {
          (void)HAL_PWR_ReleaseResourceSemaphore((Item >> WIO_RESOURCE_POS) & (uint16_t)msk);
        }
        return HAL_ERROR;
      }
    }
    msk += (1UL << position);
    position++;
  }
  return HAL_OK;
}


/**
  * @brief  Release semaphore(s) of  WIO pin bitmap.
  * @param  Item : wake-up io pin bitmap
  * @retval HAL Status, HAL_OK
  */
HAL_StatusTypeDef HAL_PWR_ReleaseResourceSemaphore(uint16_t Item)
{
  uint32_t position = 0x00;
  uint32_t iocurrent;
  __IO uint32_t *regaddr;

  /* Check the parameters */
  assert_param(IS_WIO_RESOURCE(Item));

  /* Get secure attribute of the port pin */
  while (((Item >> WIO_RESOURCE_POS) >> position) != 0U)
  {
    /* Get current io position */
    iocurrent = ((uint32_t)Item >> WIO_RESOURCE_POS) & (1UL << position);
    if (iocurrent != 0U)
    {
      /* Release Semaphore*/
      regaddr = &PWR->WIO1SEMCR + (WIO_CID_CFG_ADD_OFFSET * position);
      *regaddr = ~PWR_WIO1SEMCR_SEM_MUTEX;
    }
    position++;
  }
  return HAL_OK;
}


/**
  * @brief  Configure RIF attribute of a PWR resource (bitmap).
  *         Available RIF attributes are CID, security and privilege protection.
  *         RIF attribute is applied on all PWR resource of input param bitmap.
  *         PWR resource is either a wake-up resource (WIO) or a Non Shareable resource (NS)
  * @note   If no CID attribute provide, CID filtering is disabled.
  * @param  Item : PWR resource bitmap.
  * @param  Attributes: RIF (CID/secure/privilege) attributes.

  * @retval void
  */
void HAL_PWR_ConfigResourceAttributes(uint16_t Item, uint32_t Attributes)
{
  /* Check the parameters */
  assert_param(IS_PWR_ITEMS(Item));

  if (IS_WIO_RESOURCE(Item))
  {
    (void)HAL_PWR_ConfigWioResourceAttributes(Item, Attributes);
  }
  if (IS_NS_RESOURCE(Item))
  {
    (void)HAL_PWR_ConfigNonShareableResourceAttributes(Item, Attributes);
  }
}

/**
  * @brief  Get a RIF attributes a single PWR resource.
  *         PWR resource is either a wake-up resource (WIO) or a Non Shareable resource (NS)
  * @note   In case input bitmap selects several resource, RIF attributes of first low rank resource is returned
  * @param  Item : PWR resource bitmap, should select only ONE resource
  * @param  pAttributes : pointer of  RIF attributes.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_PWR_GetConfigResourceAttributes(uint16_t Item, uint32_t *pAttributes)
{
  /* Check the parameters */
  assert_param(IS_PWR_ITEMS(Item));

  if (IS_WIO_RESOURCE(Item))
  {
    return (HAL_PWR_GetConfigWioResourceAttributes(Item, pAttributes));
  }
  if (IS_NS_RESOURCE(Item))
  {
    return (HAL_PWR_GetConfigNonShareableResourceAttributes(Item, pAttributes));
  }
  return HAL_OK;
}


/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_PWR_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
